[
    {
        "title": "Prices of onions, pulses, cotton hit 3-year low",
        "content": "Sep 26, 2025, 12:13 AM ISTPrices of essential commodities like onions and pulses have plummeted to multi-year lows due to increased imports and reduced exports. A surge in pulse imports, coupled with bumper crops in countries like Australia and Brazil, has suppressed domestic prices. Government intervention through buffer stock releases and excess rainfall impacting crop quality are further contributing to the price decline.",
        "scores": {
            "Harmful for farmers": 0.5430570244789124,
            "Neutral": 0.394029438495636,
            "Positive for farmers": 0.06291352212429047
        }
    },
    {
        "title": "SC seeks response of Centre on PIL seeking import curbs on yellow peas",
        "content": "Sep 25, 2025, 12:28 PM ISTThe Supreme Court has asked the Central government for a response. This concerns a Public Interest Litigation about restricting yellow pea imports. The plea argues these imports harm pulse farmers' livelihoods. Kisan Mahapanchayat filed the PIL. Advocate Prashant Bhushan represents the farmers. The court wants to ensure consumers don't suffer from potential shortages.",
        "scores": {
            "Harmful for farmers": 0.9632181525230408,
            "Neutral": 0.023488782346248627,
            "Positive for farmers": 0.013293075375258923
        }
    },
    {
        "title": "25K prawn farmers, 62 seafood entrepreneurs in Odisha affected by US tariff hike: Minister",
        "content": "Sep 24, 2025, 03:02 PM ISTA recent US tariff hike on Indian goods has significantly impacted Odisha's seafood industry, affecting 62 processing entrepreneurs and 25,000 prawn farmers. The additional tariffs, including penalties for purchasing Russian crude oil, have disrupted exports, with 24.5% of Odisha's marine products destined for the US.",
        "scores": {
            "Harmful for farmers": 0.9653388857841492,
            "Neutral": 0.027007613331079483,
            "Positive for farmers": 0.007653475273400545
        }
    },
    {
        "title": "Parliament panel flags surge in cheap tea imports from Kenya, Nepal; seeks stricter labelling rules",
        "content": "Sep 18, 2025, 08:22 PM ISTThe Parliamentary Standing Committee on Commerce is concerned about the surge in cheap tea imports from Kenya and Nepal. They've urged the Tea Board to enforce mandatory labeling and source declaration to protect India-origin tea's reputation. The committee also suggests reviewing the Indo-Nepal trade agreement and implementing strict measures to safeguard Darjeeling tea's GI tag from adulteration.",
        "scores": {
            "Harmful for farmers": 0.5194981098175049,
            "Neutral": 0.3833317160606384,
            "Positive for farmers": 0.09717009961605072
        }
    },
    {
        "title": "Kisan activists want agri office to be moved to Pinjore apple mandi for now",
        "content": "68% of India’s farmland drought-prone, south worst hit: Climate experts warn A national conference in Mulugu district has issued a stark warning about India's agricultural future. Experts revealed that nearly 68% of India's sown land is vulnerable to drought, impacting vegetable productivity. minister’s convoy in Hingoli demanding wet drought declaration",
        "scores": {
            "Harmful for farmers": 0.9086447954177856,
            "Neutral": 0.07083454728126526,
            "Positive for farmers": 0.020520662888884544
        }
    },
    {
        "title": "Heavy rain damages 273 hectares of crops in district",
        "content": "Punjab and Sind Bank recruitment 2025: Apply online for MMGS-II posts at punjabandsind.bank.in Punjab and Sind Bank recruitment 2025: Punjab and Sind Bank has released a recruitment notification for 190 MMGS-II posts, including Credit Manager and Manager roles. The online application process commenced on September 19, 2025, and will conclude on October 10, 2025. Eligible candidates can apply via punjabandsind.bank.in. The selection process includes professional preference for qualifications such as CA, CMA, CFA, or MBA (Finance). Appointed candidates will receive a monthly salary between Rs 64,820 and Rs 93,960.",
        "scores": {
            "Harmful for farmers": 0.7252126932144165,
            "Neutral": 0.22347065806388855,
            "Positive for farmers": 0.05131663382053375
        }
    },
    {
        "title": "Flood relief efforts in Maharashtra have been marred by controversy as Deputy CM Shinde and minister Sarnaik faced criticism for distributing aid with their posters, sparking accusations of political exploitation. Farmers in Jalna protested against the slow assessment of crop losses, prompting assurances of compensation before Diwali. Ministers are visiting affected areas to expedite the process and provide relief.",
        "content": "B Ashok’s transfer: Kerala HC asks CAT to consider petitions’ maintainability Tractors, 2-wheelers to see high single digit growth in FY26: ICRA Panel proposes merger of 2 Mizoram PSUs to curb losses",
        "scores": {
            "Harmful for farmers": 0.6456934809684753,
            "Neutral": 0.2817496955394745,
            "Positive for farmers": 0.07255677878856659
        }
    },
    {
        "title": "Frustrated by unaddressed demands, they've threatened to boycott the upcoming rabi campaign",
        "content": "Punjab minister Tarunpreet Singh Sond’s gives call against field fires in Ludhiana. TNN / Sep 25, 2025, 01:18 (IST) PAU, ICAR launch centres to empower rural women in Ludhiana. TNN / Sep 20, 2025, 01:30 (IST) 56,301 crop damage applications being processed Sep 23, 2025, 23:56 (IST) 56,301 crop damage applications being processed Sep 23, 2025, 23:55 (IST) How to effectively pass on GST benefits to farmers? agriculture minister to deliberate today TNN / Sep 19, 2025, 05:00 (IST) Kisan activists want agri office to be moved to Pinjore apple mandi for now TNN / Sep 21, 2025, 00:24 (IST) 68% of India’s farmland drought-prone, south worst hit: Climate experts warn TNN / Sep 19, 2025, 23:45 (IST) A national conference in Mulugu district has issued a stark warning about India's agricultural future",
        "scores": {
            "Harmful for farmers": 0.658005952835083,
            "Neutral": 0.2653990089893341,
            "Positive for farmers": 0.07659509032964706
        }
    },
    {
        "title": "Experts revealed that nearly 68% of India's sown land is vulnerable to drought, impacting vegetable productivity",
        "content": "Protesters block agriculture minister’s convoy in Hingoli demanding wet drought declaration Sep 21, 2025, 00:18 (IST) Heavy rain damages 273 hectares of crops in district Sep 24, 2025, 04:08 (IST) Punjab and Sind Bank recruitment 2025: Apply online for MMGS-II posts at punjabandsind.bank.in TOI Education / Sep 20, 2025, 19:07 (IST) Punjab and Sind Bank recruitment 2025: Punjab and Sind Bank has released a recruitment notification for 190 MMGS-II posts, including Credit Manager and agriculture Manager roles. The online application process commenced on September 19, 2025, and will conclude on October 10, 2025. Eligible candidates can apply via punjabandsind.bank.in",
        "scores": {
            "Harmful for farmers": 0.644701361656189,
            "Neutral": 0.309134840965271,
            "Positive for farmers": 0.046163834631443024
        }
    }
]
